app/controllers/orders_controller.rb

SELECT * FROM "orders"
---
  def index
    @orders = Order.all

SELECT * FROM "orders" WHERE ("orders"."id" = 1)
---
  def show
    @order = Order.find(params[:id])

INSERT INTO "orders" ("address", "city", "zip", "created_at", "updated_at", "last_name", "first_name", "state") VALUES('', '', '', '2009-06-21 02:53:18', '2009-06-21 02:53:18', '', '', '')
---
  def create
    @order = Order.new(params[:order])
    if @order.save

SELECT * FROM "orders" WHERE ("orders"."id" = 1)
DELETE FROM "orders" WHERE "id" = 1
---
  def destroy
    @order = Order.find(params[:id])
    @order.destroy